#include "MyArray.h"
#include <iostream>
#include <ctime>

using namespace std;

int main()
{
    srand(time(NULL)); // для випадкових чисел пізніше у коді

    // створюємо змінні та просимо надати ромзір масиву
    int n, min, max, x, choice;
    cout << "Введіть розмір масиву: ";
    
    // перевірка чи правильно ввели розмір 
    while (!(cin >> n))
    {
        cout << "Помилка у введені розміру масиву! Спробуйте ще раз!\n";
        cin.clear();
        cin.ignore(1000, '\n');
        cout << "Введіть розмір масиву: ";
    }

    cout << "Введіть спосіб заповнення масиву 1 - Одиницями (default), 2 - Випадкові значення від min до max, 3 - Заповнити вручну: ";

    // перевірка чи правильно ввели варіант 
    while (!(cin >> choice) || choice > 3 || choice < 1)
    {
        cout << "Помилка у введені варіанту дії! Спробуйте ще раз!\n";
        cin.clear();
        cin.ignore(1000, '\n');
        cout << "Введіть спосіб заповнення масиву 1 - Не заповнювати (default), 2 - Випадкові значення від min до max, 3 - Заповнити вручну: ";
    }


    switch (choice)
    {
        case 1:
        {
            // створюємо масив за допомогою додаткового конструктору ініціалізації
            MyArray array(n);
            // виводимо масив на екран
            cout << "Початковий масив з конструкту ініціалізації (default): " << endl;
            array.print();
            cout << "Введіть x: "; 
            cin >> x;
            cout << "Результат: " << array.comparison(x);
            break;
        }

        case 2:
        {
            // просимо ввести мінімальний та максимальний значення елементів
            cout << "\nВведіть мінімальне значення масиву: ";
            cin >> min;

            cout << "Введіть максимальне значення масиву: ";
            cin >> max;

            // створюємо другий масив, але вже в зазначеному діапазоні та виводимо на екран
            MyArray array(n);
            array.fillArray(min, max);
            cout << "Початковий масив з автоматичною ініціалізацією: " << endl;
            array.print();
            cout << "Введіть x: "; 
            cin >> x;
            cout << "Результат: " << array.comparison(x);
            break;
        }

        case 3:
        {// створюємо початковий масив
            MyArray array(n);
            // перезаповнюємо масив, але вже всі елементи записує користувач
            array.setArray();

            // просимо значення х та порівнюємо з елементами масиву, результати виводимо на екран
            cout << "Введіть значення х: ";
            cin >> x;
            cout << "Результат: " << array.comparison(x);
            break;
        }
    }
}
