#include <iostream>
#include "LinearEquation.h"

using namespace std;

int main()
{
    // створення змінних 
    double a, b, x;

    // просимо ввести зміну а та перевіряємо чи правильно ввели значення
    cout << "Введіть значення а: ";

    while (!(cin >> a))
    {
        cout << "\nПомилка: неправильно введене значення а, спробуйте ще раз!\n";
        cin.clear();
        cin.ignore(1000, '\n');
        cout << "Введіть значення а: ";
    }

    // повторюємо теж саме зі змінною b
    cout << "Введіть значення b: ";

    while (!(cin >> b))
    {
        cout << "\nПомилка, неправильно введене значення b, спробуйте ще раз!\n";
        cin.clear();
        cin.ignore(1000, '\n');
        cout << "Введіть значення b: ";
    }

    // вивід початкових значень
    cout << "\n\nЗначення а: " << a << "\nЗначення b: " << b;

    // створення нового об'єкту
    LinearEquation new_equation;

    // встановлюємо значення а та b для розрахунків і перевіряємо на обмеження
    new_equation.setAB(a, b);

    // якщо все у зоні допустимих значень, то виводимо про це повідомлення і вирішуємо приклад
    // якщо ні, то виводимо повідомлення і завершуємо програму
    if (new_equation.checkRestrictions())
    {
        cout << "\nа та b у зоні допустимих значень!";
        new_equation.solution(&x);
        cout << "\n\nx = " << x;

    }
    else
    {
        cout << "\nа та b не у зоні допустимих значень, подальший розв'язок неможливий.";
    }
}
